xml/sample_venta.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ven="http://example.com/ventaVehiculos">
   <soapenv:Header/>
   <soapenv:Body>
      <ven:RegistrarVenta>
         <ven:cliente>
            <ven:Id>123</ven:Id>
            <ven:Nombre>Juan Pérez</ven:Nombre>
            <ven:Documento>CC100200300</ven:Documento>
            <ven:Email>juan.perez@example.com</ven:Email>
            <ven:Telefono>3001234567</ven:Telefono>
         </ven:cliente>
         <ven:vehiculo>
            <ven:Placa>ABC123</ven:Placa>
            <ven:Marca>Toyota</ven:Marca>
            <ven:Modelo>Corolla</ven:Modelo>
            <ven:Precio>85000.50</ven:Precio>
         </ven:vehiculo>
      </ven:RegistrarVenta>
   </soapenv:Body>
</soapenv:Envelope>
